/* REXX */

stuff_to_do = 1

do while stuff_to_do
  nop
end

finished = 0

do until finished 
  nop
end

do forever
  if is_true() then iterate
  else leave
end

is_true:
  return random(0, 1)